Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/government_in_ireland/the_president/president_and_the_defence_forces.html.txt.tmx
Source language: en
Languages: ga

source: President and the Defence Forces
ga: An tUachtarán agus na Fórsaí Cosanta

source: The President of Ireland is Supreme Commander of the Irish Defence Forces
ga: Is é/í Uachtarán na hÉireann an tArdcheannasaí ar Fhórsaí Cosanta na hÉireann

source: Officers in the Defence Forces hold commissions from the President
ga: Is ón Uachtarán a fhaigheann oifigigh na bhFórsaí Cosanta a gcoimisiúin

source: Under the Defence Act of 1954, military command is exercised by the Irish Government through the Minister for Defence who manages and controls the forces
ga: De réir Acht Cosanta na bliana 1954, is é Rialtas na hÉireann a riarann ceannasaíocht an airm tríd an Aire Cosanta a bhainistíonn agus a stiúraíonn na fórsaí

source: The Defence Forces in Ireland consist of:
ga: Is iad na ranna atá i bhFórsaí Cosanta na hÉireann ná:

source: • Permanent Defence Force and
ga: • an Buan-Fhórsa Cosanta (BFC) agus

source: There is more information in our document on the Defence Forces
ga: Tá tuilleadh eolais inár ndoiciméad ar Óglaigh na hÉireann
